xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_clk.c
/**
  ******************************************************************************
  * @file stm8_clk.c
  * @brief This file contains all the functions for the CLK peripheral.
  * @author STMicroelectronics
  * @version V0.04
  * @date 21-DEC-2007
  ******************************************************************************
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2007 STMicroelectronics</center></h2>
  * @image html logo.bmp
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include "stm8_clk.h"

/* LINKER SECTIONS DEFINITION FOR THIS FILE ONLY */
#ifdef USE_COSMIC_SECTIONS
#pragma section (CLK_CODE)
#pragma section const {CLK_CONST}
#pragma section @near [CLK_URAM]
#pragma section @near {CLK_IRAM}
#pragma section @tiny [CLK_UZRAM]
#pragma section @tiny {CLK_IZRAM}
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* Private Constants ---------------------------------------------------------*/

/**
  * @addtogroup CLK_Private_Constants
  * @{
  */

uc8 HSIDivFactor[4] = {1, 2, 4, 8}; /*!< Holds the different HSI Dividor factors */
uc8 CLKPrescTable[8] = {1, 2, 4, 8, 10, 16, 20, 40}; /*!< Holds the different CLK prescaler values */

/**
  * @}
  */

/* Public functions ----------------------------------------------------------*/
/**
  * @addtogroup CLK_Public_Functions
  * @{
  */

/**
  * @brief Deinitializes the CLK peripheral registers to their default reset
  * values.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
   * @par Warning:
  *  Resetting the CCOR register: \n
  * When the CCOEN bit is set, the reset of the CCOR register require
  * two consecutive write instructions in order to reset first the CCOEN bit
  * and the second one is to reset the CCOSEL bits.
  * @par Called functions:
  * None
  * @par Example:
  * This example shows how to call the function:
  * @code
  * CLK_DeInit();
  * @endcode
  */
void CLK_DeInit(void)
{

  CLK->ICKR = CLK_ICKR_RESET_VALUE;
  CLK->ECKR = CLK_ECKR_RESET_VALUE;
  CLK->SWR  = CLK_SWR_RESET_VALUE;
  CLK->SWCR = CLK_SWCR_RESET_VALUE;
  CLK->CKDIVR = CLK_CKDIVR_RESET_VALUE;
  CLK->PCKENR1 = CLK_PCKENR1_RESET_VALUE;
  CLK->PCKENR2 = CLK_PCKENR2_RESET_VALUE;
  CLK->CSSR = CLK_CSSR_RESET_VALUE;
  CLK->CCOR = CLK_CCOR_RESET_VALUE;
  while(CLK->CCOR & CLK_CCOR_CCOEN);
  CLK->CCOR = CLK_CCOR_RESET_VALUE;
  CLK->CANCCR = CLK_CANCCR_RESET_VALUE;
  CLK->HSITRIMR = CLK_HSITRIMR_RESET_VALUE;
  CLK->SWIMCCR = CLK_SWIMCCR_RESET_VALUE;

}

/**
  * @brief Fills CLK_InitStruct members with default value.
  * @param[in] CLK_InitStruct Pointer to CLK_Init_TypeDef structure that will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * CLK_Init_TypeDef CLK_InitStructure;
  * CLK_StructInit(&CLK_InitStructure);
  * @endcode
  */
void CLK_StructInit(CLK_Init_TypeDef* CLK_InitStruct)
{
  /* Reset CLK init structure parameters values */
  /* Initialize the CLK fast wake up from halt */
  CLK_InitStruct->CLK_FastHaltWakeup              = DISABLE;

  /* Initialize the CLK Prescaler division factor */
  CLK_InitStruct->CLK_HSIPrescaler                = CLK_PRESCALER_HSIDIV8;

  /* Initialize the CLK switch mode */
  CLK_InitStruct->CLK_SwitchMode       = CLK_SWITCHMODE_AUTO;

  /* Initialize the new clock selection */
  CLK_InitStruct->CLK_NewClock         = CLK_SOURCE_HSI;

  /* Initialize the CLK switch interrupt status */
  CLK_InitStruct->CLK_SwitchIT         = DISABLE;

  /* Initialize the current CLK state */
  CLK_InitStruct->CLK_CurrentClockState           = CLK_CURRENTCLOCKSTATE_ENABLE;

}

/**
  * @brief Initializes the CLK peripheral according to the specified parameters
  * in the CLK_InitStruct structure.
  * @param[in] CLK_InitStruct: pointer to an CLK_Init_TypeDef structure that
  * contains the configuration information of the CLK peripheral.
  * @retval void None
  * @par Required preconditions:
  *  Call the CLK_DeInit function or the CLK_StructInit function
  * @par Called functions:
  * - CLK_ClockSwitchConfig();
  * - CLK_HSIConfig();
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * ErrorStatus val;
  * val = CLK_Init(&CLK_InitStructure);
  * if (val == ERROR) { ... }
  * @endcode
  */
ErrorStatus CLK_Init(CLK_Init_TypeDef* CLK_InitStruct)
{
  ErrorStatus Status = ERROR;

  /* Check the parameters */
  assert_param(IS_CLK_SOURCE_OK(CLK_InitStruct->CLK_NewClock));
  assert_param(IS_CLK_SWITCHMODE_OK(CLK_InitStruct->CLK_SwitchMode));
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_InitStruct->CLK_SwitchIT));
  assert_param(IS_CLK_CURRENTCLOCKSTATE_OK(CLK_InitStruct->CLK_CurrentClockState));
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_InitStruct->CLK_FastHaltWakeup));
  assert_param(IS_CLK_HSIPRESCALER_OK(CLK_InitStruct->CLK_HSIPrescaler));


  /* Select and configure Clock */
  if (CLK_InitStruct->CLK_NewClock != CLK_SOURCE_HSI)
  {
    Status = CLK_ClockSwitchConfig(CLK_InitStruct->CLK_SwitchMode, CLK_InitStruct->CLK_NewClock, CLK_InitStruct->CLK_SwitchIT, CLK_InitStruct->CLK_CurrentClockState);
  }
  else /* CLK_InitStruct->CLK_NewClock == CLK_SOURCE_HSI*/
  {
    CLK_HSIConfig(CLK_InitStruct->CLK_FastHaltWakeup, CLK_InitStruct->CLK_HSIPrescaler);
    Status = SUCCESS;
  }
  return Status;
}

/**
  * @brief Enable or Disable the External High Speed oscillator (HSE).
  * @param[in] CLK_NewState new state of HSEEN, value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_HSECmd(ENABLE);
  * @endcode
  */
void CLK_HSECmd(FunctionalState CLK_NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));

  if (CLK_NewState != DISABLE)
  {
    /* Set HSEEN bit */
    CLK->ECKR |= CLK_ECKR_HSEEN;
  }
  else
  {
    /* Reset HSEEN bit */
    CLK->ECKR &= (u8)(~CLK_ECKR_HSEEN);
  }
}

/**
  * @brief Enables or disables the Internal High Speed oscillator (HSI).
   * @param[in] CLK_NewState new state of HSIEN, value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_HSICmd(ENABLE);
  * @endcode
  */
void CLK_HSICmd(FunctionalState CLK_NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));

  if (CLK_NewState != DISABLE)
  {
    /* Set HSIEN bit */
    CLK->ICKR |= CLK_ICKR_HSIEN;
  }
  else
  {
    /* Reset HSIEN bit */
    CLK->ICKR &= (u8)(~CLK_ICKR_HSIEN);
  }
}

/**
  * @brief Enables or disables the Internal Low Speed oscillator (LSI).
   * @param[in]  CLK_NewState new state of LSIEN, value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_LSICmd(ENABLE);
  * @endcode
  */
void CLK_LSICmd(FunctionalState CLK_NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));

  if (CLK_NewState != DISABLE)
  {
    /* Set LSIEN bit */
    CLK->ICKR |= CLK_ICKR_LSIEN;
  }
  else
  {
    /* Reset LSIEN bit */
    CLK->ICKR &= (u8)(~CLK_ICKR_LSIEN);
  }
}

/**
  * @brief Enables or disablle the Configurable Clock Output (CCO).
  * @param[in] CLK_NewState new state of CCEN bit (CCO register), value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_CCOCmd(ENABLE)
  * @endcode
  */
void CLK_CCOCmd(FunctionalState CLK_NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));

  if (CLK_NewState != DISABLE)
  {
    /* Set CCOEN bit */
    CLK->CCOR |= CLK_CCOR_CCOEN;
  }
  else
  {
    /* Reset CCOEN bit */
    CLK->CCOR &= (u8)(~CLK_CCOR_CCOEN);
  }

