xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_clk.c
}


/**
  * @brief Starts or Stops manually the clock switch execution.
  * @par Full description:
  * CLK_NewState parameter set the SWEN.
  * @param[in] CLK_NewState new state of SWEN, value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_ClockSwitchCmd(ENABLE);
  * @endcode
  */

void CLK_ClockSwitchCmd(FunctionalState CLK_NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));

  if (CLK_NewState != DISABLE )
  {
    /* Enable the Clock Switch */
    CLK->SWCR |= CLK_SWCR_SWEN;
  }
  else
  {
    /* Disable the Clock Switch */
    CLK->SWCR &= (u8)(~CLK_SWCR_SWEN);
  }
}

/**
  * @brief  Enables or disables the specified peripheral CLK.
  * @param[in] CLK_Peripheral this parameter specifies the peripheral clock to gate.
  * It can be set of the values of @ref CLK_Peripheral_TypeDef.
  * @param[in] CLK_NewState new state of specified peripheral clock, value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER1, ENABLE);
  * @endcode
  */
void CLK_PeripheralClockConfig(CLK_Peripheral_TypeDef CLK_Peripheral, FunctionalState CLK_NewState)
{
  
  /* Check the parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_NewState));
  assert_param(IS_CLK_PERIPHERAL_OK(CLK_Peripheral));

  if ((CLK_Peripheral & 0x10) == 0x0)
  {
	  if (CLK_NewState != DISABLE)
	  {
		  /* Enable the peripheral Clock */
		  CLK->PCKENR1 |= (u8)((u8)1 << (u8)(CLK_Peripheral & (u8)0x0F));
	  }
	  else
	  {
		  /* Disable the peripheral Clock */
		  CLK->PCKENR1 &= (u8)(~(u8)(((u8)1 << (u8)(CLK_Peripheral & (u8)0x0F))));
	  }
  }
  else
  {
	  if (CLK_NewState != DISABLE)
	  {
		  /* Enable the peripheral Clock */
		  CLK->PCKENR2 |= (u8)((u8)1 << (u8)(CLK_Peripheral & (u8)0x0F));
	  }
	  else
	  {
		  /* Disable the peripheral Clock */
		  CLK->PCKENR2 &= (u8)(~(u8)(((u8)1 << (u8)(CLK_Peripheral & (u8)0x0F))));
	  }
  }
}

/**
  * @brief Switch from one clock to another with or without interrupt,
  * and switch off or not the previous clock.
  * @param[in] CLK_SwitchMode select the clock switch mode.
  * It can be set of the values of @ref CLK_SwitchMode_TypeDef
  * @param[in] CLK_NewClock choice of the future clock.
  * It can be set of the values of @ref CLK_Source_TypeDef
  * @param[in] CLK_SwitchIT Enable or Disable the Clock Switch interrupt.
  * @param[in] CLK_CurrentClockState current clock to switch OFF or to keep ON.
  * It can be set of the values of @ref CLK_CurrentClockState_TypeDef
  * @retval ErrorStatus this shows the clock switch status (ERROR/SUCCESS).
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * ErrorStatus val;
  * val = CLK_CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_HSI, DISABLE, CLK_CURRENTCLOCKSTATE_DISABLE);
  * if (val == ERROR) { ... }
  * @endcode
  */
ErrorStatus CLK_ClockSwitchConfig(CLK_SwitchMode_TypeDef CLK_SwitchMode, CLK_Source_TypeDef CLK_NewClock, FunctionalState CLK_SwitchIT, CLK_CurrentClockState_TypeDef CLK_CurrentClockState)
{
  CLK_Source_TypeDef clock_master;
  u16 DownCounter = CLK_TIMEOUT;
  ErrorStatus Swif = ERROR;

  /* Check the parameters */
  assert_param(IS_CLK_SOURCE_OK(CLK_NewClock));
  assert_param(IS_CLK_SWITCHMODE_OK(CLK_SwitchMode));
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_SwitchIT));
  assert_param(IS_CLK_CURRENTCLOCKSTATE_OK(CLK_CurrentClockState));

  /*option byte config */
  if (CLK_NewClock == CLK_SOURCE_LSI)
  {
    *(unsigned char*)0x5069 = 0x08;
    *(unsigned char*)0x506A = (u8)(~0x08);
  }

  /* Current clock master saving */
  clock_master = CLK->CMSR;

  /* Automatic switch mode management */
  if (CLK_SwitchMode == CLK_SWITCHMODE_AUTO)
  {
    /* Enables Clock switch */
    CLK->SWCR |= CLK_SWCR_SWEN;
    /* Enables or Disables Switch interrupt */
    if (CLK_SwitchIT != DISABLE)
    {
      CLK->SWCR |= CLK_SWCR_SWIEN;
    }
    else
    {
      CLK->SWCR &= (u8)(~CLK_SWCR_SWIEN);
    }
    /* Selection of the target clock source */
    CLK->SWR = (u8)CLK_NewClock;
   
      while (((CLK->SWCR & CLK_SWCR_SWBSY) && (DownCounter != 0)))
      {
        DownCounter--;
      }
      if (DownCounter != 0)
      {
        Swif = SUCCESS;
      }
    
  }
  else /* CLK_SwitchMode == CLK_SWITCHMODE_MANUAL */
  {
    /* Enables or Disables Switch interrupt  if required  */
    if (CLK_SwitchIT != DISABLE)
    {
      CLK->SWCR |= CLK_SWCR_SWIEN;
    }
    else
    {
      CLK->SWCR &= (u8)(~CLK_SWCR_SWIEN);
    }
    /* Selection of the target clock source */
    CLK->SWR = (u8)CLK_NewClock;
    /* In manual mode, there is no risk to be stucked in a loop, value returned
      is then always SUCCESS */
    Swif = SUCCESS;
  }
  /* Switch OFF current clock if required */
  if (CLK_CurrentClockState == CLK_CURRENTCLOCKSTATE_DISABLE)
  {
    switch (clock_master)
    {
      case CLK_SOURCE_HSI:
        CLK->ICKR &= (u8)(~CLK_ICKR_HSIEN);
        break;
      case CLK_SOURCE_LSI:
        CLK->ICKR &= (u8)(~CLK_ICKR_LSIEN);
        break;
      case CLK_SOURCE_HSE:
        CLK->ECKR &= (u8)(~CLK_ECKR_HSEEN);
        break;
      default:
        break;
    }
  }
  return Swif;
}

/**
  * @brief  Configures the High Speed Internal oscillator (HSI).
  * @par Full description:
  * If CLK_FastHaltWakeup is enabled, HSI oscillator is automatically
  * switched-on (HSIEN=1) and selected as next clock master
  * (CKM=SWI=HSI) when resuming from HALT/ActiveHalt modes.\n
  * @param[in] CLK_FastHaltWakeup this parameter is the Wake-up Mode.
  * @param[in] HSIPrescaler this second parameter is the Clock Prescaler.
  * It can be set of the values of @ref CLK_Prescaler_TypeDef
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_HSIConfig(ENABLE, CLK_PRESCALER_HSIDIV2);
  * @endcode
  */
void CLK_HSIConfig(FunctionalState CLK_FastHaltWakeup, CLK_Prescaler_TypeDef HSIPrescaler)
{

