xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_clk.c
  /* check teh parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_FastHaltWakeup));
  assert_param(IS_CLK_HSIPRESCALER_OK(HSIPrescaler));

  /* Clear High speed internal clock prescaler */
  CLK->CKDIVR &= (u8)(~CLK_CKDIVR_HSIDIV);

  /* Set High speed internal clock prescaler */
  CLK->CKDIVR |= (u8)HSIPrescaler;

  if (CLK_FastHaltWakeup != DISABLE)
  {
    /* Set FHWU bit (HSI oscillator is automatically switched-on) */
    CLK->ICKR |= CLK_ICKR_FHWU;
  }
  else  /* FastHaltWakeup = DISABLE */
  {
    /* Reset FHWU bit */
    CLK->ICKR &= (u8)(~CLK_ICKR_FHWU);
  }
}

/**
  * @brief Configures the Low Speed Internal oscillator (LSI).
  * @param[in] CLK_SlowActiveHalt specifies the Fast or Slow Active Halt mode.
   * can be set of the following values:
  * - DISABLE: Slow Active Halt mode disabled;
  * - ENABLE:  Slow Active Halt mode enabled.
  * @retval  void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_LSIConfig(ENABLE);
  * @endcode
  */
void CLK_LSIConfig(FunctionalState CLK_SlowActiveHalt)
{
  /* check teh parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(CLK_SlowActiveHalt));

  if (CLK_SlowActiveHalt != DISABLE)
  {
    /* Set S_ACTHALT bit */
    CLK->ICKR |= CLK_ICKR_SWUAH;
  }
  else
  {
    /* Reset S_ACTHALT bit */
    CLK->ICKR &= (u8)(~CLK_ICKR_SWUAH);
  }

}

/**
  * @brief Output the selected clock on a dedicated I/O pin.
  * @param[in] CLK_CCO specifies the clock source.
  * @retval void None
  * @par Required preconditions:
  * The dedicated I/O pin must be set at 1 in the corresponding Px_CR1 register \n
  * to be set as input with pull-up or push-pull output.
  * @par Called functions:
  * -  CLK_CCOCmd();
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_CCOConfig(CLK_OUTPUT_HSE );
  * @endcode
  */
void CLK_CCOConfig(CLK_Output_TypeDef CLK_CCO)
{
  /* check teh parameters */
  assert_param(IS_CLK_OUTPUT_OK(CLK_CCO));

  /* Clears of the CCO type bits part */
  CLK->CCOR &= (u8)(~CLK_CCOR_CCOSEL);

  /* Selects the source provided on cco_ck output */
  CLK->CCOR |= CLK_CCO;

  /* Enable the clock output */
  CLK_CCOCmd(ENABLE);
}

/**
  * @brief  Enables or disables the specified CLK interrupts.
   * @param[in] CLK_IT This parameter specifies the interrupt sources.
   * It can be one of the values of @ref CLK_IT_TypeDef.
  * @param[in] IT_NewState New state of the Interrupt.
  * Value accepted ENABLE, DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_ITConfig(CLK_IT_SWIE, ENABLE);
  * @endcode
  */
void CLK_ITConfig(CLK_IT_TypeDef CLK_IT, FunctionalState IT_NewState)
{
  /* check teh parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(IT_NewState));
  assert_param(IS_CLK_IT_OK(CLK_IT));

  if (IT_NewState != DISABLE)
  {
    switch (CLK_IT)
    {
      case CLK_IT_SWIE: /* Enable the clock switch interrupt */
        CLK->SWCR |= CLK_SWCR_SWIEN;
        break;
      case CLK_IT_CSSDIE: /* Enable the clock security system detection interrupt */
        CLK->CSSR |= CLK_CSSR_CSSDIE;
        break;
      default:
        break;
    }
  }
  else  /*(IT_NewState == DISABLE)*/
  {
    switch (CLK_IT)
    {
      case CLK_IT_SWIE: /* Disable the clock switch interrupt */
        CLK->SWCR  &= (u8)(~CLK_SWCR_SWIEN);
        break;
      case CLK_IT_CSSDIE: /* Disable the clock security system detection interrupt */
        CLK->CSSR &= (u8)(~CLK_CSSR_CSSDIE);
        break;
      default:
        break;
    }
  }
}

/**
  * @brief Configures the HSI and CPU clock dividers.
  * @param[in] ClockPrescaler Specifies the HSI or CPU clock divider to apply.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * These examples shows how to call the function:
  * @code
  * CLK_SYSCLKConfig(CLK_HSI_DIV2);
  * or
  * CLK_SYSCLKConfig(CLK_CPU_DIV8);
  * @endcode
  */
void CLK_SYSCLKConfig(CLK_Prescaler_TypeDef ClockPrescaler)
{

  /* check teh parameters */
  assert_param(IS_CLK_PRESCALER_OK(ClockPrescaler));


  if ((ClockPrescaler & (u8)0x80) == 0x00) /* Bit7 = 0 means HSI divider */
  {
    CLK->CKDIVR &= (u8)(~CLK_CKDIVR_HSIDIV);
    CLK->CKDIVR |= (u8)(ClockPrescaler & CLK_CKDIVR_HSIDIV);
  }
  else /* Bit7 = 1 means CPU divider */
  {
    CLK->CKDIVR &= (u8)(~CLK_CKDIVR_CPUDIV);
    CLK->CKDIVR |= (u8)(ClockPrescaler & CLK_CKDIVR_CPUDIV);
  }

}
/**
  * @brief Configures the SWIM clock frequency on the fly.
  * @param[in] CLK_SWIMDivider Specifies the SWIM clock divider to apply.
  * can be one of the value of @ref CLK_SWIMDivider_TypeDef
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * These examples shows how to call the function:
  * @code
  * CLK_SWIMConfig(CLK_SWIMDIVIDER_2);
  * @endcode
  */
void CLK_SWIMConfig(CLK_SWIMDivider_TypeDef CLK_SWIMDivider)
{
  /* check teh parameters */
  assert_param(IS_CLK_SWIMDIVIDER_OK(CLK_SWIMDivider));

  if (CLK_SWIMDivider != CLK_SWIMDIVIDER_2)
  {
    /* SWIM clock is not divided by 2 */
    CLK->SWIMCCR |= CLK_SWIMCCR_SWIMDIV;
  }
  else /* CLK_SWIMDivider == CLK_SWIMDIVIDER_2 */
  {
    /* SWIM clock is divided by 2 */
    CLK->SWIMCCR &= (u8)(~CLK_SWIMCCR_SWIMDIV);
  }
}

/**
  * @brief Configure the divider for the external CAN clock.
  * @param[in] CLK_CANDivider Specifies the CAN clock divider to apply.
  * can be one of the value of @ref CLK_CANDivider_TypeDef
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * These examples shows how to call the function:
  * @code
  * CLK_CANConfig(CLK_CANDIVIDER_1);
  * @endcode
  */
void CLK_CANConfig(CLK_CANDivider_TypeDef CLK_CANDivider)
{
  /* check teh parameters */
  assert_param(IS_CLK_CANDIVIDER_OK(CLK_CANDivider));

  /*Clear the CANDIV bits */
  CLK->CANCCR &= (u8)(~CLK_CANCCR_CANDIV);

  /* Select divider*/
  CLK->CANCCR |= CLK_CANDivider;
}

/**
  * @brief Enables the Clock Security System.
  * @par Full description:
  * once CSS is enabled it cannot be disabled until the next reset.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_ClockSecuritySystemEnable();
  * @endcode
  */
void CLK_ClockSecuritySystemEnable(void)
{
  /* Set CSSEN bit  */
  CLK->CSSR |= CLK_CSSR_CSSEN;
}

/**
  * @brief Returns the clock source used as system clock.
  * @par Parameters:
  * None
  * @retval  Clock source used.
  * can be one of the values of @ref CLK_Source_TypeDef
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  *CLK_Source_TypeDef val;
  * val = CLK_GetSYSCLKSource();
  * @endcode
  */
CLK_Source_TypeDef CLK_GetSYSCLKSource(void)
{
  return((CLK_Source_TypeDef)CLK->CMSR);
}


/**
  * @brief Checks whether the specified CLK interrupt has is enabled or not.
  * @param[in] CLK_IT specifies the CLK interrupt.
  * can be one of the values of @ref CLK_IT_TypeDef
  * @retval ITStatus, new state of CLK_IT (SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * ITStatus val;
  * val = CLK_GetITStatus(CLK_IT_SWIE);
  * if (val == RESET) { ... }
  * @endcode
  */
ITStatus CLK_GetITStatus(CLK_IT_TypeDef CLK_IT)
{
  ITStatus bitstatus = RESET;

