xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_clk.c
  /* check teh parameters */
  assert_param(IS_CLK_IT_OK(CLK_IT));

  if (CLK_IT == CLK_IT_SWIE)
  {
    /* Check the status of the clock switch interrupt */
    if ((CLK->SWCR & (u8)CLK_SWCR_SWIEN) != (u8)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else /* CLK_IT == CLK_IT_CSSDIE */
  {
    /* Check the status of the security system detection interrupt */
    if ((CLK->CSSR & (u8)CLK_CSSR_CSSDIE) != (u8)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }

  /* Return the CLK_IT status */
  return  bitstatus;
}

/**
  * @brief Checks whether the specified CLK flag is set or not.
  * @par Full description:
  * @param[in] CLK_FLAG Flag to check.
  * can be one of the values of @ref CLK_Flag_TypeDef
  * @retval FlagStatus, status of the checked flag
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_GetFlagStatus(CLK_FLAG_LSIRDY);
  * @endcode
  */
FlagStatus CLK_GetFlagStatus(CLK_Flag_TypeDef CLK_FLAG)
{
  u16 statusreg = 0;
  u8 tmpreg = 0;
  FlagStatus bitstatus = RESET;

  /* check teh parameters */
  assert_param(IS_CLK_FLAG_OK(CLK_FLAG));

  /* Get the CLK register index */
  //statusreg = (u8)(CLK_FLAG >> (u8)8);
  statusreg = (CLK_FLAG &= 0xFF00);
  switch (statusreg)
  {
    case 0x100: /* The flag to check is in ICKRregister */
      tmpreg = CLK->ICKR;
      break;
    case 0x200: /* The flag to check is in ECKRregister */
      tmpreg = CLK->ECKR;
      break;
    case 0x300: /* The flag to check is in SWIC register */
      tmpreg = CLK->SWCR;
      break;
    case 0x400: /* The flag to check is in CSS register */
      tmpreg = CLK->CSSR;
      break;
    case 0x500: /* The flag to check is in CCO register */
      tmpreg = CLK->CCOR;
      break;
    default:
      break;
  }

  if ((tmpreg & (u8)CLK_FLAG) != (u8)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  /* Return the flag status */
  return (u8)bitstatus;
}

/**
  * @brief This function returns the frequencies of different on chip clocks.
   * @par Parameters:
  * None
  * @retval the master clock frequency
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * u32 masterfrequency = 0;
  * masterfrequency = CLK_GetClockFreq();
  * @endcode
  */
u32 CLK_GetClockFreq(void)
{

  u32 clockfrequency = 0;
  CLK_Source_TypeDef clocksource = 0xE1;
  u8 tmp = 0, presc = 0;

  /* Get CLK source. */
  clocksource = CLK->CMSR;

  switch (clocksource)
  {
    case CLK_SOURCE_HSI:
      tmp = (u8)(CLK->CKDIVR & CLK_CKDIVR_HSIDIV);
      tmp = (u8)(tmp >> 3);
      presc = HSIDivFactor[tmp];
      clockfrequency = HSI_VALUE / presc;
      break;
    case CLK_SOURCE_LSI:
      clockfrequency = LSI_VALUE;
      break;
    case CLK_SOURCE_HSE:
      clockfrequency = HSE_VALUE;
      break;
    default:
      break;
  }
  return((u32)clockfrequency);
}

/**
  * @brief Adjusts the Internal High Speed oscillator (HSI) calibration value.
  * @par Full description:
  * @param[in] CLK_HSICalibrationValue calibration trimming value.
  * can be one of the values of @ref CLK_HSITrimValue_TypeDef
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_AdjustHSICalibrationValue(CLK_HSITRIMVALUE_5)
  * @endcode
  */
void CLK_AdjustHSICalibrationValue(CLK_HSITrimValue_TypeDef CLK_HSICalibrationValue)
{

  /* check the parameters */
  assert_param(IS_CLK_HSITRIMVALUE_OK(CLK_HSICalibrationValue));

  /* Clear HSITRIM[2:0] bits */
  CLK->HSITRIMR &= (u8)(~CLK_HSITRIMR_HSITRIM);

  /* Store the new value */
  CLK->HSITRIMR |= (u8)CLK_HSICalibrationValue;

}

/**
  * @brief Clears the CLK’s interrupt pending bits.
  * @param[in] CLK_PendingBit specifies the interrupt pending bits.
  * can be one of the values of @ref CLK_PendingBit_TypeDef
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_ClearITPendingBit(CLK_PENDINGBIT_CSSD);
  * @endcode
  */
void CLK_ClearITPendingBit(CLK_PendingBit_TypeDef CLK_PendingBit)
{
  /* check the parameters */
  assert_param(IS_CLK_PENDINGBIT_OK(CLK_PendingBit));

  if (CLK_PendingBit == (u8)CLK_PENDINGBIT_CSSD)
  {
    /* Clear the status of the security system detection interrupt */
    CLK->CSSR  &= (u8)(~CLK_CSSR_CSSD);
  }
  else /* CLK_PendingBit == (u8)CLK_PENDINGBIT_SWIF */
  {
    /* Clear the status of the clock switch interrupt */
    CLK->SWCR &= (u8)(~CLK_SWCR_SWIF);
  }

}

/**
  * @brief Reset the SWBSY flag (SWICR Reister)
  * @par Full description:
  * This function reset SWBSY flag in order to reset clock switch operations (target
  * oscillator is broken, stabilization is longing too much, etc.).  If at the same time \n
  * software attempts to set SWEN and clear SWBSY, SWBSY action takes precedence.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Examples:
  * This example shows how to call the function:
  * @code
  * CLK_SYSCLKEmergencyClear();
  * @endcode
  */
void CLK_SYSCLKEmergencyClear(void)
{
  CLK->SWCR &= (u8)(~CLK_SWCR_SWBSY);
}



/**
  * @}
  */

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
